#include <stdio.h>
#include <math.h>
int check_if_prime(int n)
{
    //проверяваме дали числото е просто
	for (int i = 2; i <= sqrt(n); i++) //Взимаме корена на въпросното число, за да намалим сложността
	{
		if (n % i == 0) //тук проверяваме дали числото се дели на някое от интервала 2 до n/2
		{
			return 0; // ако условието е вярно, значи числото НЕ е просто
		}
	}

	return 1; // ако не е вярно, значи числото е просто
}

int main()
{
	int n; //инициализираме n
	printf("Vuvedete broq prosti chisla ot vida 4k+3: \n");
	scanf_s("%d", &n); //въвеждаме n
	for (int i = 3, count = 1, k = 0; count <= n; i++)
    /*инициализираме брояч, с който да спрем цикъла,
     започваме от числото 3, защото то е най-малкото,
     което отговаря на двете условия */
	{
		if(i == (4 * k + 3))
		{
			if (check_if_prime(i))
			{
				printf("%d ", i);
				count++; //увеличаваме count само когато и двете условия са верни
			}
			k++; //увеличаваме k когато 4 * k + 3 е вярно
		}
	}

	return 0;
}
